# pandas 의 데이터구조 
    1. series 데이터   -> 1차원?
    2. 데이터 프레임    -> 2차원?
    
https://www.kdnuggets.com/2017/01/pandas-cheat-sheet.html

In [93]:
import numpy as np
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

# 데이터 프레임 생성
리스트로 데이터 프레임 만들기
* dataframe([[list1],[list2]])
* 각 list는 한 행으로 구성됨
* 행의 원소 개수가 다르면 None 값으로 저장

In [5]:
# 2차원 데이터 프레임 생성 리스트가 `행` 으로 감
df = pd.DataFrame([['a','b','c'],['a','a','g'],['a','a']])
df

   0  1     2
0  a  b     c
1  a  a     g
2  a  a  None

In [9]:
# 딕셔너리로 생성
# 열방향 인덱스[문자] 행방향 인덱스[숫자]가 있는 데이터 프레임 생성
# 열데이터를 dict 형태로 작성하는게 일반적 
df1 = pd.DataFrame({'a':[90,80,70],'b':[85,98,75],'c':[88,99,77],'d':[70,75,76]})
df1

    a   b   c   d
0  90  85  88  70
1  80  98  99  75
2  70  75  77  76

## df2 생성

In [41]:
# 딕셔너리로 데이터 프레임 형성
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2000002],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010~2015 증가율":[0.0283, 0.0163, 0.0982,0.0141]
}

df2 = pd.DataFrame(data)
df2

      2015     2010     2005     2000   지역  2010~2015 증가율
0  9904312  9631482  9762546  9853972  수도권         0.0283
1  3448737  3393191  3512547  3655437  경상권         0.0163
2  2890451  2632035  2517680  2466338  수도권         0.0982
3  2466052  2000002  2456016  2473990  경상권         0.0141

In [42]:
# 열방향 인덱스 columns = 
columns = ['지역','2015','2010','2005','2010','2010~2015 증가율']
# 행방향 인덱스 index = 
index = ['서울','부산','인천','대구']
df2 = pd.DataFrame(data,index = index ,columns = columns)
df2

     지역     2015     2010     2005     2010  2010~2015 증가율
서울  수도권  9904312  9631482  9762546  9631482         0.0283
부산  경상권  3448737  3393191  3512547  3393191         0.0163
인천  수도권  2890451  2632035  2517680  2632035         0.0982
대구  경상권  2466052  2000002  2456016  2000002         0.0141

In [43]:
# 시리즈로 데이터 프레임 생성
a = pd.Series([100,200,300],index = ['a','b','d'])
b = pd.Series([101,201,301],index = ['a','b','h'])
c = pd.Series([110,210,310],index = ['a','b','c'])
pd.DataFrame([a,b,c],index = [100,101,102])

         a      b      d      h      c
100  100.0  200.0  300.0    NaN    NaN
101  101.0  201.0    NaN  301.0    NaN
102  110.0  210.0    NaN    NaN  310.0

## csv 데이터로 부터 데이터 프레임 생성
* 데이터 분석을 위해 데이터 프레임을 생성하는 가장 일반적인방법
* 데이터 소스로부터 추출된 csv 파일로부터 생성
* pandas.read_csv() 함수 사용

https://www.kaggle.com/hesh97/titanicdataset-traincsv/data

In [44]:
trainData = pd.read_csv('./csv_File/train.csv')
trainData.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [45]:
trainData = pd.read_csv('./csv_File/train.csv', 
                       index_col = 'PassengerId',
                       usecols = ['PassengerId','Survived','Pclass', 'Name'])
trainData

,Survived,Pclass,Name
PassengerId,,,
1,0,3,"Braund, Mr. Owen Harris"
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
3,1,3,"Heikkinen, Miss. Laina"
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
5,0,3,"Allen, Mr. William Henry"
...,...,...,...
887,0,2,"Montvila, Rev. Juozas"
888,1,1,"Graham, Miss. Margaret Edith"
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie"""
890,1,1,"Behr, Mr. Karl Howell"
891,0,3,"Dooley, Mr. Patrick"

In [46]:
trainData.columns

Index(['Survived', 'Pclass', 'Name'], dtype='object')

In [47]:
# 열방향 인덱스 출력
df2.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [48]:
df2.index.name = '도시'
df2.columns.name = '특성'
df2

특성   지역     2015     2010     2005     2010  2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9631482         0.0283
부산  경상권  3448737  3393191  3512547  3393191         0.0163
인천  수도권  2890451  2632035  2517680  2632035         0.0982
대구  경상권  2466052  2000002  2456016  2000002         0.0141

In [49]:
# 데이터 프레임의 개요 출력
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 대구
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지역             4 non-null      object
 1   2015           4 non-null      int64
 2   2010           4 non-null      int64
 3   2005           4 non-null      int64
 4   2010           4 non-null      int64
 5   2010~2015 증가율  4 non-null      float64
dtypes: float64(1), int64(4), object(1)
memory usage: 224.0+ bytes

In [50]:
# 통계적 기술통계 : 수치형 데이터에 대하여 
# 통계분석에 많이 사용
# 수치형으로 계산되어있음
df2.describe()

특성             2015          2010          2005          2010  2010~2015 증가율
count  4.000000e+00  4.000000e+00  4.000000e+00  4.000000e+00       4.000000
mean   4.677388e+06  4.414178e+06  4.562197e+06  4.414178e+06       0.039225
std    3.507776e+06  3.524531e+06  3.500545e+06  3.524531e+06       0.039809
min    2.466052e+06  2.000002e+06  2.456016e+06  2.000002e+06       0.014100
25%    2.784351e+06  2.474027e+06  2.502264e+06  2.474027e+06       0.015750
50%    3.169594e+06  3.012613e+06  3.015114e+06  3.012613e+06       0.022300
75%    5.062631e+06  4.952764e+06  5.075047e+06  4.952764e+06       0.045775
max    9.904312e+06  9.631482e+06  9.762546e+06  9.631482e+06       0.098200

* shape: 데이터 프레임의 행,렬 개수 출력

In [51]:
# (행,열)의 개수 출력
df2.shape

(4, 6)

In [52]:
df2

특성   지역     2015     2010     2005     2010  2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9631482         0.0283
부산  경상권  3448737  3393191  3512547  3393191         0.0163
인천  수도권  2890451  2632035  2517680  2632035         0.0982
대구  경상권  2466052  2000002  2456016  2000002         0.0141

In [53]:
# 전치
dfT = df2.T
dfT

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2000002
2005           9762546  3512547  2517680  2456016
2010           9631482  3393191  2632035  2000002
2010~2015 증가율   0.0283   0.0163   0.0982   0.0141

***해당 열이 있으면 갱신 , 열이 없으면 추가***

In [54]:
df2

특성   지역     2015     2010     2005     2010  2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9631482         0.0283
부산  경상권  3448737  3393191  3512547  3393191         0.0163
인천  수도권  2890451  2632035  2517680  2632035         0.0982
대구  경상권  2466052  2000002  2456016  2000002         0.0141

In [55]:
# 열추가 증가율 변경
# 해당 이름이 없으면 추가 됨
df2['2010~2015 증가율'] = df2['2010~2015 증가율']*100
df2

특성   지역     2015     2010     2005     2010  2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9631482           2.83
부산  경상권  3448737  3393191  3512547  3393191           1.63
인천  수도권  2890451  2632035  2517680  2632035           9.82
대구  경상권  2466052  2000002  2456016  2000002           1.41

In [57]:
# 열추가 
df2['2010-2015 증가율'] = ((df2['2015']-df2['2005'])/df2['2005']*100).round(2)
df2

특성   지역     2015     2010     2005     2010  2010~2015 증가율  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9631482           2.83           1.45
부산  경상권  3448737  3393191  3512547  3393191           1.63          -1.82
인천  수도권  2890451  2632035  2517680  2632035           9.82          14.81
대구  경상권  2466052  2000002  2456016  2000002           1.41           0.41

In [60]:
p = ((df2['2015']-df2['2005'])/df2['2005']*100).round(2)
df2['2010-2015 증가율(%)'] = p.map('{}%'.foramt)
df2

AttributeError: 'str' object has no attribute 'foramt'

In [59]:
# 열삭제 
del df2['2010-2015 증가율']
df2

특성   지역     2015     2010     2005     2010  2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9631482           2.83
부산  경상권  3448737  3393191  3512547  3393191           1.63
인천  수도권  2890451  2632035  2517680  2632035           9.82
대구  경상권  2466052  2000002  2456016  2000002           1.41

In [61]:
# 인덱스 라벨값 1개 사용
df2['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [62]:
# 열1개를 접근할때는 연산자 사용사는 df.컬럼명
df2.지역

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [67]:
type(df2['지역'])

pandas.core.series.Series

In [65]:
df2[['지역']]

특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [66]:
type(df2[['지역']])

pandas.core.frame.DataFrame

In [68]:
df2[['2010','2015']]  # 왜 2개나옴??

특성     2010     2010     2015
도시
서울  9631482  9631482  9904312
부산  3393191  3393191  3448737
인천  2632035  2632035  2890451
대구  2000002  2000002  2466052

In [70]:
df2[1]

KeyError: 1

In [73]:
try : 
    df2[0] # keyerror 발생
except Exception as e :
    print(type(e))

<class 'KeyError'>

In [77]:
df3 = pd.DataFrame(np.arange(12).reshape(3,4),)
df3

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [78]:
# 컬럼명이 숫자로 되어있는 df의 접근 
df3[0]

0    0
1    4
2    8
Name: 0, dtype: int32

In [80]:
df3[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

## 행단위 인덱싱

In [81]:
df2

특성   지역     2015     2010     2005     2010  2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9631482           2.83
부산  경상권  3448737  3393191  3512547  3393191           1.63
인천  수도권  2890451  2632035  2517680  2632035           9.82
대구  경상권  2466052  2000002  2456016  2000002           1.41

***슬라이싱 사용하면 행추출임***

In [82]:
# 1행 추출   
df2[:1]

특성   지역     2015     2010     2005     2010  2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9631482           2.83

In [83]:
df2[0:1]

특성   지역     2015     2010     2005     2010  2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9631482           2.83

In [85]:
df2[1:3]

특성   지역     2015     2010     2005     2010  2010~2015 증가율
도시
부산  경상권  3448737  3393191  3512547  3393191           1.63
인천  수도권  2890451  2632035  2517680  2632035           9.82

In [87]:
df2[:'서울']

특성   지역     2015     2010     2005     2010  2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9631482           2.83

In [88]:
# 대괄호 주의점 
# 그냥 쓰면 열이름
# 슬라이싱쓰면 행이름 
df2['서울':'부산']

특성   지역     2015     2010     2005     2010  2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9631482           2.83
부산  경상권  3448737  3393191  3512547  3393191           1.63

* 개별요소 접근 [열][행]

In [89]:
df2['2015']['서울']

9904312

In [90]:
type(df2['2015']['서울'])

numpy.int64

In [91]:
df2['2015']['서울':'부산']

도시
서울    9904312
부산    3448737
Name: 2015, dtype: int64

In [94]:
df2[['2015','2010','2005']]['서울':'부산']

특성     2015     2010     2010     2005
도시
서울  9904312  9631482  9631482  9762546
부산  3448737  3393191  3393191  3512547

* 데이터 프레임은 열기준으로 접근하는게 원칙 : [열이름] 
- 행기준 접근 하기 위해서는 슬라이싱을 적용 : [행이름:행이름]  행이름 -> 인덱스
- 행과열을 같이 적용(개별요쇼) : [열이름][행이름]

# 설정변경 코드 
- 변수명이 두번이상 바뀌어도 출력가능

***from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"***

# 판다스 데이터 인덱싱
## 데이터 프레임 인덱서 : loc ,iloc
* loc: 라벨값 기반의 2차우너 인덱싱
- iloc: 순서를 나타내는 정수 기반의 2차우너 인덱싱

### loc 인덱서 (행우선 인덱서)
- ***loc[] 안에 모든 값을 표시되있는 인덱스 또는 콜론 값 으로만 한다***
- loc 를사용하게 되면 문자 인덱스가 아닌 숫자여도 :끝범위를 포함한다

In [96]:
# 예제 데이터프레임 생성
df = pd.DataFrame(np.arange(10,22).reshape(3,4),index = 'a b c'.split(),columns = ['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [97]:
# 하나만 받는 경우 
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [98]:
# 에러 예제
# loc 를 쓰면 행우선
# 안쓰면 열우선
df.loc['A']

KeyError: 'A'

In [100]:
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [101]:
df['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [103]:
df.loc[['b','c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [104]:
df.loc[['a','c']]

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [105]:
# b행을 출력
# 시리즈 행태
df.loc['b']

A    14
B    15
C    16
D    17
Name: b, dtype: int32

In [106]:
# 하나 지정시 2개하면 데이터 프레임 형태
df.loc[['b']]

    A   B   C   D
b  14  15  16  17

- 열기준이므로 키에러 나옴
- 콘마 구분시 열이름 loc 미사용시

In [ ]:

df[['b','c']]

### boolean selection

In [107]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [108]:
df.A>15

a    False
b    False
c     True
Name: A, dtype: bool

In [110]:
df.loc[df.A>15]  # df.[df.A>15] 이거는 두개가 똑같음

    A   B   C   D
c  18  19  20  21

In [111]:
# 함수 작성
def sel_row(df):
    return df.A>15
# true 나 false 반환

In [113]:
sel_row(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [114]:
# 함수이용 
df.loc[sel_row(df)]

    A   B   C   D
c  18  19  20  21

### loc 인덱서 슬라이싱

In [116]:
df2 = pd.DataFrame(np.arange(10,26).reshape(4,4),columns =  'a b c d'.split())
df2

    a   b   c   d
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [117]:
# 값 인덱싱 - 슬라이싱 초기값:끝값
df2.loc[1:2]

    a   b   c   d
1  14  15  16  17
2  18  19  20  21

In [118]:
# 위치 인덱싱 - 슬라이싱 초기위치 : 끝위치+1
df[1:2]

    A   B   C   D
b  14  15  16  17

***loc 인덱서 사용요소 접근***
- 인덱싱으로 행과 열을 모두 받는 경우
- 문법 df.loc[행,열]-라벨(문자열) 인덱스 사용

#### 연습

In [119]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [120]:
# a행의 A열
df.loc['a','A']

10

In [121]:
# loc를 사용한 원소값 변경
# df.locp행,열] = 값
df.loc['a','A'] = 50
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [122]:
df.loc['a'] # 시리즈 반환

A    50
B    11
C    12
D    13
Name: a, dtype: int32

In [123]:
df[:'a']

    A   B   C   D
a  50  11  12  13

In [124]:
df.loc[['a']]  # 데이터 프레임

    A   B   C   D
a  50  11  12  13

In [126]:
# 2차원
df.loc['a',:]  # 시리즈 반환

A    50
B    11
C    12
D    13
Name: a, dtype: int32

In [129]:
df
df.loc['a','B':'C']

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

B    11
C    12
Name: a, dtype: int32

In [130]:
df.loc['b':,'A']

b    14
c    18
Name: A, dtype: int32

In [133]:
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [141]:
# a,b행으 B,D열 
df.loc['a':'b',['B','D']]

    B   D
a  11  13
b  15  17

In [142]:
df.loc[['a','c'],['B','D']]

    B   D
a  11  13
c  19  21

### iloc 인덱서(위치 인덱서)
- 데이터프레임.[행,열]
- intloc
- ***모든 iloc[] 안에 값을 숫자로만 한다***

In [143]:
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [145]:
# 0행 1열 선택
df.iloc[0,1]

11

In [147]:
# 0행 1열 df형태로 반환-슬라이싱 사용
# 행과열 동시에 짜름 데이터 프레임
df.iloc[0:2,1:2]

    B
a  11
b  15

In [149]:
# 1차원이라 시리즈
df.iloc[0:2,1]

a    11
b    15
Name: B, dtype: int32

In [150]:
# 0행의 2번재 열부터 끝열까지
df.iloc[0,2:]

C    12
D    13
Name: a, dtype: int32

In [152]:
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [153]:
# 0행의 마지막 열부터 
df.iloc[0,-2:]   # 시리즈 형태
df.iloc[0:1,-2:]  # 프레임 형태

C    12
D    13
Name: a, dtype: int32

    C   D
a  12  13

- iloc[행위치,열위치] -> 원소값 반환
- iloc[행위치1:행위치2,열위치1:열위치2] -> 원소 반환: df 반환
- iloc[행위치,열위치1:열위치2] -> 원소반환 :시리즈 반환
- iloc[행위치1:행위치2,열위치]->원소반환 : 시리즈 반환

#### 연습문제

In [156]:
a = pd.DataFrame(np.arange(25,50).reshape(5,5),index = 'a b c d e'.split(),columns = 'A B C D E'.split())
a

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

In [158]:
a.iloc[1:2,1:2]

    B
b  31

In [179]:
# A열 추출
a.iloc[0:,0]
a.iloc[:,0:1]

a    25
b    30
c    35
d    40
e    45
Name: A, dtype: int32

    A
a  25
b  30
c  35
d  40
e  45

In [167]:
# 0행부터 2행까지 추출
a.iloc[0:3]

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

In [177]:
# 1행의 3,4열 추출
a.iloc[1,3:5] # 시리즈
a.iloc[1:2,3:5] # 데이터

D    33
E    34
Name: b, dtype: int32

    D   E
b  33  34

In [187]:
# a행에서 c행까지 중 B와 D열 추출
a.loc['a':'c',['B','D']]
a.iloc[:3,[1,3]]

    B   D
a  26  28
b  31  33
c  36  38

    B   D
a  26  28
b  31  33
c  36  38